{
  "ADANIENT.NS": {
    "sector": "Conglomerate",
    "industry": "Diversified",
    "summary": "Adanient is a leading Indian company operating in the Diversified sector with activities across India and international markets. The company is primarily engaged in core businesses related to diversified, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Adanient has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the conglomerate industry. Adanient serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "ADANIGREEN.NS": {
    "sector": "Conglomerate",
    "industry": "Diversified",
    "summary": "Adanigreen is a leading Indian company operating in the Diversified sector with activities across India and international markets. The company is primarily engaged in core businesses related to diversified, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Adanigreen has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the conglomerate industry. Adanigreen serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "ADANIPORTS.NS": {
    "sector": "Conglomerate",
    "industry": "Diversified",
    "summary": "Adaniports is a leading Indian company operating in the Diversified sector with activities across India and international markets. The company is primarily engaged in core businesses related to diversified, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Adaniports has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the conglomerate industry. Adaniports serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "ADANIPOWER.NS": {
    "sector": "Energy",
    "industry": "Power & Oil & Gas",
    "summary": "Adanipower is a leading Indian company operating in the Power & Oil & Gas sector with activities across India and international markets. The company is primarily engaged in core businesses related to power & oil & gas, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Adanipower has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the energy industry. Adanipower serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "AMBUJACEM.NS": {
    "sector": "Materials",
    "industry": "Cement",
    "summary": "Ambujacem is a leading Indian company operating in the Cement sector with activities across India and international markets. The company is primarily engaged in core businesses related to cement, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Ambujacem has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the materials industry. Ambujacem serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "APOLLOHOSP.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Apollohosp is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Apollohosp has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Apollohosp serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "ASIANPAINT.NS": {
    "sector": "Consumer Discretionary",
    "industry": "Paints & Coatings",
    "summary": "Asianpaint is a leading Indian company operating in the Paints & Coatings sector with activities across India and international markets. The company is primarily engaged in core businesses related to paints & coatings, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Asianpaint has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the consumer discretionary industry. Asianpaint serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "AUBANK.NS": {
    "sector": "Financial Services",
    "industry": "Banking & Finance",
    "summary": "Aubank is a leading Indian company operating in the Banking & Finance sector with activities across India and international markets. The company is primarily engaged in core businesses related to banking & finance, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Aubank has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the financial services industry. Aubank serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "AUROPHARMA.NS": {
    "sector": "Healthcare",
    "industry": "Pharmaceuticals",
    "summary": "Auropharma is a leading Indian company operating in the Pharmaceuticals sector with activities across India and international markets. The company is primarily engaged in core businesses related to pharmaceuticals, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Auropharma has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the healthcare industry. Auropharma serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "AXISBANK.NS": {
    "sector": "Financial Services",
    "industry": "Banking & Finance",
    "summary": "Axisbank is a leading Indian company operating in the Banking & Finance sector with activities across India and international markets. The company is primarily engaged in core businesses related to banking & finance, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Axisbank has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the financial services industry. Axisbank serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "BAJAJ-AUTO.NS": {
    "sector": "Automobile",
    "industry": "Auto Manufacturing",
    "summary": "Bajaj Auto is a leading Indian company operating in the Auto Manufacturing sector with activities across India and international markets. The company is primarily engaged in core businesses related to auto manufacturing, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Bajaj Auto has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the automobile industry. Bajaj Auto serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "BAJAJFINSV.NS": {
    "sector": "Financial Services",
    "industry": "Banking & Finance",
    "summary": "Bajajfinsv is a leading Indian company operating in the Banking & Finance sector with activities across India and international markets. The company is primarily engaged in core businesses related to banking & finance, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Bajajfinsv has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the financial services industry. Bajajfinsv serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "BAJFINANCE.NS": {
    "sector": "Financial Services",
    "industry": "Banking & Finance",
    "summary": "Bajfinance is a leading Indian company operating in the Banking & Finance sector with activities across India and international markets. The company is primarily engaged in core businesses related to banking & finance, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Bajfinance has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the financial services industry. Bajfinance serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "BANDHANBNK.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Bandhanbnk is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Bandhanbnk has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Bandhanbnk serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "BANKBARODA.NS": {
    "sector": "Financial Services",
    "industry": "Banking & Finance",
    "summary": "Bankbaroda is a leading Indian company operating in the Banking & Finance sector with activities across India and international markets. The company is primarily engaged in core businesses related to banking & finance, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Bankbaroda has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the financial services industry. Bankbaroda serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "BEL.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "BEL is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, BEL has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. BEL serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "BERGEPAINT.NS": {
    "sector": "Consumer Discretionary",
    "industry": "Paints & Coatings",
    "summary": "Bergepaint is a leading Indian company operating in the Paints & Coatings sector with activities across India and international markets. The company is primarily engaged in core businesses related to paints & coatings, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Bergepaint has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the consumer discretionary industry. Bergepaint serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "BHARTIARTL.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Bhartiartl is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Bhartiartl has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Bhartiartl serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "BIOCON.NS": {
    "sector": "Healthcare",
    "industry": "Pharmaceuticals",
    "summary": "Biocon is a leading Indian company operating in the Pharmaceuticals sector with activities across India and international markets. The company is primarily engaged in core businesses related to pharmaceuticals, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Biocon has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the healthcare industry. Biocon serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "BPCL.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "BPCL is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, BPCL has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. BPCL serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "BRITANNIA.NS": {
    "sector": "Consumer Staples",
    "industry": "FMCG & Food",
    "summary": "Britannia is a leading Indian company operating in the FMCG & Food sector with activities across India and international markets. The company is primarily engaged in core businesses related to fmcg & food, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Britannia has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the consumer staples industry. Britannia serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "CANBK.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Canbk is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Canbk has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Canbk serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "CHOLAFIN.NS": {
    "sector": "Financial Services",
    "industry": "Banking & Finance",
    "summary": "Cholafin is a leading Indian company operating in the Banking & Finance sector with activities across India and international markets. The company is primarily engaged in core businesses related to banking & finance, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Cholafin has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the financial services industry. Cholafin serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "CIPLA.NS": {
    "sector": "Healthcare",
    "industry": "Pharmaceuticals",
    "summary": "Cipla is a leading Indian company operating in the Pharmaceuticals sector with activities across India and international markets. The company is primarily engaged in core businesses related to pharmaceuticals, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Cipla has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the healthcare industry. Cipla serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "COALINDIA.NS": {
    "sector": "Materials",
    "industry": "Metals & Mining",
    "summary": "Coalindia is a leading Indian company operating in the Metals & Mining sector with activities across India and international markets. The company is primarily engaged in core businesses related to metals & mining, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Coalindia has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the materials industry. Coalindia serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "CUMMINSIND.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Cumminsind is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Cumminsind has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Cumminsind serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "DABUR.NS": {
    "sector": "Consumer Staples",
    "industry": "FMCG & Food",
    "summary": "Dabur is a leading Indian company operating in the FMCG & Food sector with activities across India and international markets. The company is primarily engaged in core businesses related to fmcg & food, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Dabur has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the consumer staples industry. Dabur serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "DIVISLAB.NS": {
    "sector": "Healthcare",
    "industry": "Pharmaceuticals",
    "summary": "Divislab is a leading Indian company operating in the Pharmaceuticals sector with activities across India and international markets. The company is primarily engaged in core businesses related to pharmaceuticals, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Divislab has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the healthcare industry. Divislab serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "DLF.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "DLF is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, DLF has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. DLF serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "DRREDDY.NS": {
    "sector": "Healthcare",
    "industry": "Pharmaceuticals",
    "summary": "Drreddy is a leading Indian company operating in the Pharmaceuticals sector with activities across India and international markets. The company is primarily engaged in core businesses related to pharmaceuticals, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Drreddy has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the healthcare industry. Drreddy serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "EICHERMOT.NS": {
    "sector": "Automobile",
    "industry": "Auto Manufacturing",
    "summary": "Eichermot is a leading Indian company operating in the Auto Manufacturing sector with activities across India and international markets. The company is primarily engaged in core businesses related to auto manufacturing, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Eichermot has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the automobile industry. Eichermot serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "GAIL.NS": {
    "sector": "Energy",
    "industry": "Power & Oil & Gas",
    "summary": "GAIL is a leading Indian company operating in the Power & Oil & Gas sector with activities across India and international markets. The company is primarily engaged in core businesses related to power & oil & gas, and its operations include manufacturing, distribution and services tailored to its market. Over the years, GAIL has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the energy industry. GAIL serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "GODREJCP.NS": {
    "sector": "Consumer Staples",
    "industry": "Household & Personal Care",
    "summary": "Godrejcp is a leading Indian company operating in the Household & Personal Care sector with activities across India and international markets. The company is primarily engaged in core businesses related to household & personal care, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Godrejcp has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the consumer staples industry. Godrejcp serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "GRASIM.NS": {
    "sector": "Materials",
    "industry": "Cement",
    "summary": "Grasim is a leading Indian company operating in the Cement sector with activities across India and international markets. The company is primarily engaged in core businesses related to cement, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Grasim has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the materials industry. Grasim serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "HAVELLS.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Havells is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Havells has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Havells serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "HCLTECH.NS": {
    "sector": "Information Technology",
    "industry": "Software & IT Services",
    "summary": "Hcltech is a leading Indian company operating in the Software & IT Services sector with activities across India and international markets. The company is primarily engaged in core businesses related to software & it services, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Hcltech has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the information technology industry. Hcltech serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "HDFCBANK.NS": {
    "sector": "Financial Services",
    "industry": "Banking & Finance",
    "summary": "Hdfcbank is a leading Indian company operating in the Banking & Finance sector with activities across India and international markets. The company is primarily engaged in core businesses related to banking & finance, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Hdfcbank has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the financial services industry. Hdfcbank serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "HDFCLIFE.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Hdfclife is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Hdfclife has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Hdfclife serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "HINDALCO.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Hindalco is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Hindalco has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Hindalco serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "HINDUNILVR.NS": {
    "sector": "Consumer Staples",
    "industry": "Household & Personal Care",
    "summary": "Hindunilvr is a leading Indian company operating in the Household & Personal Care sector with activities across India and international markets. The company is primarily engaged in core businesses related to household & personal care, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Hindunilvr has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the consumer staples industry. Hindunilvr serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "ICICIBANK.NS": {
    "sector": "Financial Services",
    "industry": "Banking & Finance",
    "summary": "Icicibank is a leading Indian company operating in the Banking & Finance sector with activities across India and international markets. The company is primarily engaged in core businesses related to banking & finance, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Icicibank has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the financial services industry. Icicibank serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "ICICIGI.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Icicigi is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Icicigi has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Icicigi serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "ICICIPRULI.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Icicipruli is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Icicipruli has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Icicipruli serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "IDFCFIRSTB.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Idfcfirstb is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Idfcfirstb has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Idfcfirstb serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "INDIGO.NS": {
    "sector": "Transport",
    "industry": "Airlines",
    "summary": "Indigo is a leading Indian company operating in the Airlines sector with activities across India and international markets. The company is primarily engaged in core businesses related to airlines, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Indigo has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the transport industry. Indigo serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "INDUSINDBK.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Indusindbk is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Indusindbk has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Indusindbk serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "INFY.NS": {
    "sector": "Information Technology",
    "industry": "Software & IT Services",
    "summary": "INFY is a leading Indian company operating in the Software & IT Services sector with activities across India and international markets. The company is primarily engaged in core businesses related to software & it services, and its operations include manufacturing, distribution and services tailored to its market. Over the years, INFY has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the information technology industry. INFY serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "IOC.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "IOC is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, IOC has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. IOC serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "IRFC.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "IRFC is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, IRFC has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. IRFC serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "ITC.NS": {
    "sector": "Consumer Staples",
    "industry": "FMCG & Food",
    "summary": "ITC is a leading Indian company operating in the FMCG & Food sector with activities across India and international markets. The company is primarily engaged in core businesses related to fmcg & food, and its operations include manufacturing, distribution and services tailored to its market. Over the years, ITC has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the consumer staples industry. ITC serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "JINDALSTEL.NS": {
    "sector": "Materials",
    "industry": "Metals & Mining",
    "summary": "Jindalstel is a leading Indian company operating in the Metals & Mining sector with activities across India and international markets. The company is primarily engaged in core businesses related to metals & mining, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Jindalstel has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the materials industry. Jindalstel serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "JIOFIN.NS": {
    "sector": "Financial Services",
    "industry": "Banking & Finance",
    "summary": "Jiofin is a leading Indian company operating in the Banking & Finance sector with activities across India and international markets. The company is primarily engaged in core businesses related to banking & finance, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Jiofin has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the financial services industry. Jiofin serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "JSWENERGY.NS": {
    "sector": "Materials",
    "industry": "Metals & Mining",
    "summary": "Jswenergy is a leading Indian company operating in the Metals & Mining sector with activities across India and international markets. The company is primarily engaged in core businesses related to metals & mining, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Jswenergy has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the materials industry. Jswenergy serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "JSWSTEEL.NS": {
    "sector": "Materials",
    "industry": "Metals & Mining",
    "summary": "Jswsteel is a leading Indian company operating in the Metals & Mining sector with activities across India and international markets. The company is primarily engaged in core businesses related to metals & mining, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Jswsteel has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the materials industry. Jswsteel serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "KOTAKBANK.NS": {
    "sector": "Financial Services",
    "industry": "Banking & Finance",
    "summary": "Kotakbank is a leading Indian company operating in the Banking & Finance sector with activities across India and international markets. The company is primarily engaged in core businesses related to banking & finance, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Kotakbank has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the financial services industry. Kotakbank serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "LICI.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "LICI is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, LICI has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. LICI serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "LT.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "LT is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, LT has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. LT serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "LTIM.NS": {
    "sector": "Information Technology",
    "industry": "Software & IT Services",
    "summary": "LTIM is a leading Indian company operating in the Software & IT Services sector with activities across India and international markets. The company is primarily engaged in core businesses related to software & it services, and its operations include manufacturing, distribution and services tailored to its market. Over the years, LTIM has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the information technology industry. LTIM serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "M&M.NS": {
    "sector": "Automobile",
    "industry": "Auto Manufacturing",
    "summary": "M&M is a leading Indian company operating in the Auto Manufacturing sector with activities across India and international markets. The company is primarily engaged in core businesses related to auto manufacturing, and its operations include manufacturing, distribution and services tailored to its market. Over the years, M&M has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the automobile industry. M&M serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "MARUTI.NS": {
    "sector": "Automobile",
    "industry": "Auto Manufacturing",
    "summary": "Maruti is a leading Indian company operating in the Auto Manufacturing sector with activities across India and international markets. The company is primarily engaged in core businesses related to auto manufacturing, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Maruti has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the automobile industry. Maruti serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "MAXHEALTH.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Maxhealth is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Maxhealth has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Maxhealth serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "MCDOWELL-N.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Mcdowell N is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Mcdowell N has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Mcdowell N serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "NESTLEIND.NS": {
    "sector": "Consumer Staples",
    "industry": "FMCG & Food",
    "summary": "Nestleind is a leading Indian company operating in the FMCG & Food sector with activities across India and international markets. The company is primarily engaged in core businesses related to fmcg & food, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Nestleind has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the consumer staples industry. Nestleind serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "NMDC.NS": {
    "sector": "Materials",
    "industry": "Metals & Mining",
    "summary": "NMDC is a leading Indian company operating in the Metals & Mining sector with activities across India and international markets. The company is primarily engaged in core businesses related to metals & mining, and its operations include manufacturing, distribution and services tailored to its market. Over the years, NMDC has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the materials industry. NMDC serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "NTPC.NS": {
    "sector": "Energy",
    "industry": "Power & Oil & Gas",
    "summary": "NTPC is a leading Indian company operating in the Power & Oil & Gas sector with activities across India and international markets. The company is primarily engaged in core businesses related to power & oil & gas, and its operations include manufacturing, distribution and services tailored to its market. Over the years, NTPC has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the energy industry. NTPC serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "OFSS.NS": {
    "sector": "Information Technology",
    "industry": "Software & IT Services",
    "summary": "OFSS is a leading Indian company operating in the Software & IT Services sector with activities across India and international markets. The company is primarily engaged in core businesses related to software & it services, and its operations include manufacturing, distribution and services tailored to its market. Over the years, OFSS has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the information technology industry. OFSS serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "ONGC.NS": {
    "sector": "Energy",
    "industry": "Power & Oil & Gas",
    "summary": "ONGC is a leading Indian company operating in the Power & Oil & Gas sector with activities across India and international markets. The company is primarily engaged in core businesses related to power & oil & gas, and its operations include manufacturing, distribution and services tailored to its market. Over the years, ONGC has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the energy industry. ONGC serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "PAYTM.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Paytm is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Paytm has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Paytm serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "PEL.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "PEL is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, PEL has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. PEL serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "PIDILITIND.NS": {
    "sector": "Materials",
    "industry": "Cement",
    "summary": "Pidilitind is a leading Indian company operating in the Cement sector with activities across India and international markets. The company is primarily engaged in core businesses related to cement, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Pidilitind has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the materials industry. Pidilitind serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "PNB.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "PNB is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, PNB has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. PNB serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "POWERGRID.NS": {
    "sector": "Energy",
    "industry": "Power & Oil & Gas",
    "summary": "Powergrid is a leading Indian company operating in the Power & Oil & Gas sector with activities across India and international markets. The company is primarily engaged in core businesses related to power & oil & gas, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Powergrid has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the energy industry. Powergrid serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "RECLTD.NS": {
    "sector": "Conglomerate",
    "industry": "Diversified",
    "summary": "Recltd is a leading Indian company operating in the Diversified sector with activities across India and international markets. The company is primarily engaged in core businesses related to diversified, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Recltd has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the conglomerate industry. Recltd serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "RELIANCE.NS": {
    "sector": "Conglomerate",
    "industry": "Diversified",
    "summary": "Reliance is a leading Indian company operating in the Diversified sector with activities across India and international markets. The company is primarily engaged in core businesses related to diversified, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Reliance has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the conglomerate industry. Reliance serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "SBILIFE.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Sbilife is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Sbilife has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Sbilife serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "SBIN.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "SBIN is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, SBIN has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. SBIN serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "SHREECEM.NS": {
    "sector": "Materials",
    "industry": "Cement",
    "summary": "Shreecem is a leading Indian company operating in the Cement sector with activities across India and international markets. The company is primarily engaged in core businesses related to cement, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Shreecem has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the materials industry. Shreecem serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "SHRIRAMFIN.NS": {
    "sector": "Financial Services",
    "industry": "Banking & Finance",
    "summary": "Shriramfin is a leading Indian company operating in the Banking & Finance sector with activities across India and international markets. The company is primarily engaged in core businesses related to banking & finance, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Shriramfin has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the financial services industry. Shriramfin serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "SIEMENS.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Siemens is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Siemens has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Siemens serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "SRF.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "SRF is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, SRF has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. SRF serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "SUNPHARMA.NS": {
    "sector": "Healthcare",
    "industry": "Pharmaceuticals",
    "summary": "Sunpharma is a leading Indian company operating in the Pharmaceuticals sector with activities across India and international markets. The company is primarily engaged in core businesses related to pharmaceuticals, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Sunpharma has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the healthcare industry. Sunpharma serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "TATACHEM.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Tatachem is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Tatachem has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Tatachem serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "TATACONSUM.NS": {
    "sector": "Consumer Staples",
    "industry": "FMCG & Food",
    "summary": "Tataconsum is a leading Indian company operating in the FMCG & Food sector with activities across India and international markets. The company is primarily engaged in core businesses related to fmcg & food, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Tataconsum has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the consumer staples industry. Tataconsum serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "TATAMOTORS.NS": {
    "sector": "Automobile",
    "industry": "Auto Manufacturing",
    "summary": "Tatamotors is a leading Indian company operating in the Auto Manufacturing sector with activities across India and international markets. The company is primarily engaged in core businesses related to auto manufacturing, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Tatamotors has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the automobile industry. Tatamotors serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "TATAPOWER.NS": {
    "sector": "Energy",
    "industry": "Power & Oil & Gas",
    "summary": "Tatapower is a leading Indian company operating in the Power & Oil & Gas sector with activities across India and international markets. The company is primarily engaged in core businesses related to power & oil & gas, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Tatapower has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the energy industry. Tatapower serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "TATASTEEL.NS": {
    "sector": "Materials",
    "industry": "Metals & Mining",
    "summary": "Tatasteel is a leading Indian company operating in the Metals & Mining sector with activities across India and international markets. The company is primarily engaged in core businesses related to metals & mining, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Tatasteel has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the materials industry. Tatasteel serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "TCS.NS": {
    "sector": "Information Technology",
    "industry": "Software & IT Services",
    "summary": "TCS is a leading Indian company operating in the Software & IT Services sector with activities across India and international markets. The company is primarily engaged in core businesses related to software & it services, and its operations include manufacturing, distribution and services tailored to its market. Over the years, TCS has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the information technology industry. TCS serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "TECHM.NS": {
    "sector": "Information Technology",
    "industry": "Software & IT Services",
    "summary": "Techm is a leading Indian company operating in the Software & IT Services sector with activities across India and international markets. The company is primarily engaged in core businesses related to software & it services, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Techm has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the information technology industry. Techm serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "TITAN.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Titan is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Titan has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Titan serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "TORNTPHARM.NS": {
    "sector": "Healthcare",
    "industry": "Pharmaceuticals",
    "summary": "Torntpharm is a leading Indian company operating in the Pharmaceuticals sector with activities across India and international markets. The company is primarily engaged in core businesses related to pharmaceuticals, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Torntpharm has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the healthcare industry. Torntpharm serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "TRENT.NS": {
    "sector": "Consumer Staples",
    "industry": "FMCG & Food",
    "summary": "Trent is a leading Indian company operating in the FMCG & Food sector with activities across India and international markets. The company is primarily engaged in core businesses related to fmcg & food, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Trent has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the consumer staples industry. Trent serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "TVSMOTOR.NS": {
    "sector": "Automobile",
    "industry": "Auto Manufacturing",
    "summary": "Tvsmotor is a leading Indian company operating in the Auto Manufacturing sector with activities across India and international markets. The company is primarily engaged in core businesses related to auto manufacturing, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Tvsmotor has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the automobile industry. Tvsmotor serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "UBL.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "UBL is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, UBL has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. UBL serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "ULTRACEMCO.NS": {
    "sector": "Materials",
    "industry": "Cement",
    "summary": "Ultracemco is a leading Indian company operating in the Cement sector with activities across India and international markets. The company is primarily engaged in core businesses related to cement, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Ultracemco has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the materials industry. Ultracemco serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "UPL.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "UPL is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, UPL has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. UPL serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "VBL.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "VBL is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, VBL has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. VBL serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "VEDL.NS": {
    "sector": "Materials",
    "industry": "Metals & Mining",
    "summary": "VEDL is a leading Indian company operating in the Metals & Mining sector with activities across India and international markets. The company is primarily engaged in core businesses related to metals & mining, and its operations include manufacturing, distribution and services tailored to its market. Over the years, VEDL has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the materials industry. VEDL serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "VOLTAS.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "Voltas is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Voltas has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. Voltas serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "WIPRO.NS": {
    "sector": "Information Technology",
    "industry": "Software & IT Services",
    "summary": "Wipro is a leading Indian company operating in the Software & IT Services sector with activities across India and international markets. The company is primarily engaged in core businesses related to software & it services, and its operations include manufacturing, distribution and services tailored to its market. Over the years, Wipro has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the information technology industry. Wipro serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  },
  "ZEEL.NS": {
    "sector": "Industrials",
    "industry": "General Industrial",
    "summary": "ZEEL is a leading Indian company operating in the General Industrial sector with activities across India and international markets. The company is primarily engaged in core businesses related to general industrial, and its operations include manufacturing, distribution and services tailored to its market. Over the years, ZEEL has expanded its portfolio through strategic investments, joint ventures and capacity additions to strengthen its presence in the industrials industry. ZEEL serves a diverse customer base including retail, institutional and enterprise clients and focuses on innovation, operational efficiency and regulatory compliance. The company maintains a network of manufacturing sites, regional offices and service centres, and reports on sustainability, corporate governance and community engagement as part of its annual disclosures."
  }
}